let page = parseInt(document.getElementById("page").innerText)

function previous() {
    if (page > 0) {
        page -= 1;
    }
}

function next() {
    if (page < 4) {
        page += 1;
    }  
}

function title_change() {
    let text;
    if (page == 0) {
        text = "Welcome To My Homeworks";
    }
    if (page == 1) {
        text = "ভুল তথ্য সনাক্ত করার কৌশল ও ব্যবহার করার মাধ্যম";
    }
    if (page == 2) {
        text = "তথ্য প্রযুক্তি থেকে আমরা যা শিখতে পারি-"
    }
    if (page == 3) {
        text = "একজন সফল উদ্যোক্তা হতে হলে যা করতে হবে-"
    }
    if (page == 4){
        text = "ধন্যবাদ ।"
    }
    document.getElementById("title").innerText = text
}

function paragraph_change() {
    let text;
    if (page == 0) {
        text = "Let's get started!";
    }
    if (page == 1) {
        text = "১। একটি বই লেখকের অনুমতি ছাড়া সেখানে অন্য লেখকের নাম দিয়ে প্রচার করা হতে পারে । <br> ২। কোনো ভুল তথ্য অন্নের নামে প্রকাশ করে প্রচার করতে পারে । <br> ৩। কণ্ঠস্বর এডিটিং করে ভুল তথ্য প্রচার করতে পারে । <br> ৪। কোনো একটি ভিডিও কন্টেন্ট তৈরি করে ভুল তথ্য প্রচার করতে পারে । <br> ৫। মুখমণ্ডল এডিটিং করে ভুল তথ্য প্রচার করতে পারে । <br><br> ভুল তথ্য সনাক্ত করার জন্য অনেক সফটওয়্যার রয়েছে । যথা- <br> ১। গুগল <br> ২। মাইক্রোসফট <br> ৩। ঈনভিদ";
    }
    if (page == 2){
        text = "১। গুগল: আমরা গুগল থেকে বিভিন্ন প্রশ্নের উত্তর পেতে পারি, ভিডিও ও ছবিসহ অনেককিছু অনুসন্ধান করতে পারি । <br> ২। টুইটার: আমরা বিশ্ব-এর বিভিন্ন জায়গা থেকে অনেক খবর জানতে পারি । <br> ৩। ইনভিদ: এখান থেকে আমরা ভুল ভিডিও বা ছবি সনাক্ত করতে শিখতে পারি । <br> ৪। ইউটিউব: আমরা এখান থেকে মানুষের বিভিন্ন অভিজ্ঞতা দেখতে পারি, বিভিন্ন বিষয় নিয়ে বিবরণ পেতে পারি । <br> ৫। ফেসবুক: আমরা ফেসবুক থেকে বিভিন্ন পণ্য সম্পরকে জানতে পারি এবং বাণিজ্য করা শিখতে পারি । <br>"
    }
    if (page == 3) {
        text = "১। যে উদ্যোগ নেবো, সেটি স্থাপন করার জন্য পরিকল্পনা করা । <br> ২। পরিকল্পনা অনুযায়ী কাজ করা । <br> ৩। দৃঢ় চিত্ত ও মনোবল নিয়ে পরিচালনা করা । <br> ৪। মুনাফা অর্জনের আশায় ঝুঁকি নিয়ে ব্যবসা করা । <br> ৫। ব্যবসার কৌশল সম্পর্কে জানা ও ব্যবহার করা । <br><br> আমি যে উদ্যোগ নিতে চাই তা হলো- ড্রপশিপিং । <br> ড্রপশিপিং হলো এক ধরনের ব্যবসা যেখানে বিক্রেতা আইপি এড্রেস ছাড়াই পণ্য বিক্রি করতে পারে এবং ক্রেতা অফিস থেকে পণ্য অনলাইনে কিনে নিয়ে যাবে । <br> এই সুবিধার কারনে আমরাও সহজে ব্যবসা করতে পারি । <br> ব্যবসা শুরু করতে শপিফ্য ওয়েবসাইট এ গিয়ে একটি অ্যাকাউন্ট খুলতে হবে, নিজের কোম্পানির নাম দিতে হবে ও ব্যবসা করার অফফিচিয়াল ওয়েবসাইট তৈরি করতে হবে । এরপর পণ্য-এর সঠিকতা যাচাইয়ের জন্য দ্রপ্সহিপ ওয়েবসাইট ব্যবহার করব । <br> এই উদ্যোগের জন্য ব্যাবহার করা সফটওয়্যার- <br> ১। shopify.com <br> ২। dropship.io"
    }
    if (page == 4){
        text = "----O----"
    }
    document.getElementById("paragraph").innerHTML = text
}

function update() {
    document.getElementById("page").innerText = page
    title_change()
    paragraph_change()
}
setInterval(update, 10)